constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    leftWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       17936;
    }
    rightWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       18036;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          124;
        startFace       18136;
    }
    atmosphere
    {
        type            patch;
        nFaces          92;
        startFace       18260;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          18144;
        startFace       18352;
    }
)

// ************************************************************************* //
